AchimPieters/ESP32-Power-Plug-with-Energy-Meter/main/main.c
/**
   Copyright 2026 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
 **/

#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>
#include <math.h>
#include <esp_log.h>
#include <esp_err.h>
#include <nvs.h>
#include <nvs_flash.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <driver/gpio.h>
#include <esp_timer.h>
#include <homekit/homekit.h>
#include <homekit/characteristics.h>

#include "esp32-lcm.h"
#include "custom_charcteristc.h"
#include <button.h>

// Step 4: BL0937 component is present and wired to HomeKit.
// We initialize the driver and periodically push Voltage/Current/Power/Energy
// values into custom characteristics under the existing Outlet service.
#include "bl0937.h"

// -------- GPIO configuration (set these in sdkconfig) --------
#define BUTTON_GPIO      CONFIG_ESP_BUTTON_GPIO
#define RELAY_GPIO       CONFIG_ESP_RELAY_GPIO
#define BLUE_LED_GPIO    CONFIG_ESP_BLUE_LED_GPIO
#define RED_LED_GPIO     CONFIG_ESP_RED_LED_GPIO   // Rode LED: WiFi/lifecycle-indicator

static const char *RELAY_TAG   = "RELAY";
static const char *BUTTON_TAG  = "BUTTON";
static const char *IDENT_TAG   = "IDENT";
static const char *BL0937_TAG  = "BL0937";
static const char *ENERGY_TAG  = "ENERGY";

// Persisted cumulative energy so it survives reboots.
// We store energy in milli-Wh (mWh) to keep it compact and avoid float issues.
static const char *ENERGY_NVS_NAMESPACE = "bl0937";
static const char *ENERGY_NVS_KEY_MWH   = "energy_mwh";
static const char *CAL_NVS_KEY_VCAL     = "v_cal";
static const char *CAL_NVS_KEY_ICAL     = "i_cal";
static const char *CAL_NVS_KEY_PCAL     = "p_cal";

// Relay state (used by both the HomeKit relay service and the BL0937 watchdog)
// NOTE: keep this definition above tasks that reference it.
static bool relay_on = false;

// Base cumulative energy loaded from NVS (mWh). Total energy = base + (energy since boot).
static uint64_t s_energy_mwh_base = 0;

// Flag set by the button handler when energy is reset. The measurement task
// uses it to re-sync its internal change tracking and force HomeKit updates.
static volatile bool s_energy_reset_requested = false;

static esp_err_t energy_load_from_nvs(void)
{
        nvs_handle_t nvs;
        esp_err_t err = nvs_open(ENERGY_NVS_NAMESPACE, NVS_READONLY, &nvs);
        if (err != ESP_OK) {
                ESP_LOGW(ENERGY_TAG, "NVS open (read) failed (%s). Using 0.", esp_err_to_name(err));
                s_energy_mwh_base = 0;
                return err;
        }

        uint64_t val = 0;
        err = nvs_get_u64(nvs, ENERGY_NVS_KEY_MWH, &val);
        nvs_close(nvs);

        if (err == ESP_OK) {
                s_energy_mwh_base = val;
                ESP_LOGI(ENERGY_TAG, "Loaded energy from NVS: %llu mWh", (unsigned long long)val);
                return ESP_OK;
        }

        if (err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGI(ENERGY_TAG, "No stored energy found in NVS yet (fresh install). Using 0.");
                s_energy_mwh_base = 0;
                return ESP_OK;
        }

        ESP_LOGW(ENERGY_TAG, "NVS get_u64 failed (%s). Using 0.", esp_err_to_name(err));
        s_energy_mwh_base = 0;
        return err;
}

static esp_err_t energy_save_to_nvs(uint64_t energy_mwh)
{
        nvs_handle_t nvs;
        esp_err_t err = nvs_open(ENERGY_NVS_NAMESPACE, NVS_READWRITE, &nvs);
        if (err != ESP_OK) {
                ESP_LOGW(ENERGY_TAG, "NVS open (write) failed (%s)", esp_err_to_name(err));
                return err;
        }

        err = nvs_set_u64(nvs, ENERGY_NVS_KEY_MWH, energy_mwh);
        if (err == ESP_OK) {
                err = nvs_commit(nvs);
        }
        nvs_close(nvs);

        if (err != ESP_OK) {
                ESP_LOGW(ENERGY_TAG, "NVS save failed (%s)", esp_err_to_name(err));
        }
        return err;
}

static void calibration_load_from_nvs(bl0937_config_t *cfg)
{
        if (!cfg) return;

        nvs_handle_t nvs;
        esp_err_t err = nvs_open(ENERGY_NVS_NAMESPACE, NVS_READONLY, &nvs);
        if (err != ESP_OK) {
                ESP_LOGW(ENERGY_TAG, "NVS open (cal read) failed (%s). Using menuconfig defaults.", esp_err_to_name(err));
                return;
        }

        float vcal = cfg->voltage_calibration;
        float ical = cfg->current_calibration;
        float pcal = cfg->power_calibration;

        size_t len = sizeof(float);
        if (nvs_get_blob(nvs, CAL_NVS_KEY_VCAL, &vcal, &len) != ESP_OK) vcal = cfg->voltage_calibration;
        len = sizeof(float);
        if (nvs_get_blob(nvs, CAL_NVS_KEY_ICAL, &ical, &len) != ESP_OK) ical = cfg->current_calibration;
        len = sizeof(float);
        if (nvs_get_blob(nvs, CAL_NVS_KEY_PCAL, &pcal, &len) != ESP_OK) pcal = cfg->power_calibration;

        nvs_close(nvs);

        // Clamp to sane ranges to prevent absurd Eve/Home displays.
        if (!isfinite(vcal) || vcal < 0.5f || vcal > 2.0f) vcal = cfg->voltage_calibration;
        if (!isfinite(ical) || ical < 0.5f || ical > 2.0f) ical = cfg->current_calibration;
        if (!isfinite(pcal) || pcal < 0.5f || pcal > 2.0f) pcal = cfg->power_calibration;

        cfg->voltage_calibration = vcal;
        cfg->current_calibration = ical;
        cfg->power_calibration   = pcal;

        ESP_LOGI(ENERGY_TAG, "Calibration (NVS/menuconfig): V=%.6f I=%.6f P=%.6f", (double)vcal, (double)ical, (double)pcal);
}

