AchimPieters/ESP32-Power-Plug-with-Energy-Meter/main/main.c
                // Total energy: base (NVS) + since-boot counter (from driver)
                const uint64_t e_since_boot_mwh = (uint64_t)((double)m.energy_wh * 1000.0);
                const uint64_t e_total_mwh = s_energy_mwh_base + e_since_boot_mwh;
                float e_total_kwh = (float)e_total_mwh / 1000000.0f;     // mWh -> kWh
                if (!isfinite(e_total_kwh) || e_total_kwh < 0.0f) e_total_kwh = 0.0f;
                e_total_kwh = roundf(e_total_kwh * 1000.0f) / 1000.0f;   // 0.001 kWh

                const int64_t now_us = esp_timer_get_time();

                // Update HomeKit characteristics only when meaningful AND rate-limited.
                if (isnan(last_v) || (fabsf(v_out - last_v) >= V_DELTA && (now_us - last_v_notify_us) >= MIN_NOTIFY_US)) {
                        last_v = v_out;
                        last_v_notify_us = now_us;
                        energy_voltage.value = HOMEKIT_FLOAT(v_out);
                        homekit_characteristic_notify(&energy_voltage, energy_voltage.value);
                }

                if (isnan(last_c) || (fabsf(c_out - last_c) >= I_DELTA && (now_us - last_c_notify_us) >= MIN_NOTIFY_US)) {
                        last_c = c_out;
                        last_c_notify_us = now_us;
                        energy_current.value = HOMEKIT_FLOAT(c_out);
                        homekit_characteristic_notify(&energy_current, energy_current.value);
                }

                if (isnan(last_p) || (fabsf(p_out - last_p) >= P_DELTA && (now_us - last_p_notify_us) >= MIN_NOTIFY_US)) {
                        last_p = p_out;
                        last_p_notify_us = now_us;
                        energy_power.value = HOMEKIT_FLOAT(p_out);
                        homekit_characteristic_notify(&energy_power, energy_power.value);
                }

                if (isnan(last_e_kwh) || (fabsf(e_total_kwh - last_e_kwh) >= E_DELTA && (now_us - last_e_notify_us) >= MIN_NOTIFY_US)) {
                        last_e_kwh = e_total_kwh;
                        last_e_notify_us = now_us;
                        energy_energy.value = HOMEKIT_FLOAT(e_total_kwh);
                        homekit_characteristic_notify(&energy_energy, energy_energy.value);
                }

                // Persist cumulative energy periodically so it survives a reboot.
                if (xTaskGetTickCount() >= next_persist) {
                        next_persist = xTaskGetTickCount() + pdMS_TO_TICKS(60000);
                        // Save the current total. Do NOT change s_energy_mwh_base during runtime;
                        // it is the "energy at boot" base. This avoids double counting.
                        (void)energy_save_to_nvs(e_total_mwh);
                }

                vTaskDelay(pdMS_TO_TICKS(BL0937_UPDATE_PERIOD_MS));
        }
}

// Relay / plug state (enige bron van waarheid)
// (defined near the top of this file)

// Forward declarations (used by status LED task)
static inline void red_led_write(bool on);

static void status_led_task(void *arg)
{
        (void)arg;

        // 50ms tick gives us stable timing without blocking other tasks.
        const TickType_t tick = pdMS_TO_TICKS(50);
        uint32_t t_ms = 0;

        while (true) {
                led_mode_t mode = s_led_mode;

                switch (mode) {
                case LED_MODE_WIFI_WAIT:
                        red_led_write(true);
                        break;
                case LED_MODE_NORMAL_OFF:
                        red_led_write(false);
                        break;
                case LED_MODE_BL0937_ERROR: {
                        // 1 blink: 200ms ON, rest OFF, repeating every 2000ms
                        const uint32_t phase = t_ms % 2000;
                        red_led_write(phase < 200);
                        break;
                }
                default:
                        red_led_write(false);
                        break;
                }

                t_ms += 50;
                vTaskDelay(tick);
        }
}

// ---------- Low-level GPIO helpers ----------

static inline void relay_write(bool on) {
        gpio_set_level(RELAY_GPIO, on ? 1 : 0);
}

static inline void blue_led_write(bool on) {
        // Blauwe LED: uitsluitend als aan/uit-indicator voor de relay (active low/high afhankelijk van hardware)
        gpio_set_level(BLUE_LED_GPIO, on ? 1 : 0);
}

static inline void red_led_write(bool on) {
        // Rode LED is active high: 1 = AAN, 0 = UIT
        gpio_set_level(RED_LED_GPIO, on ? 1 : 0);
}

// Visual feedback helper: blink the RED LED 3x, but restore its previous state
// afterwards (RED LED is also used for Wi‑Fi status).
static void blink_red_led_3x(void)
{
        const int prev = gpio_get_level(RED_LED_GPIO);
        for (int i = 0; i < 3; i++) {
                red_led_write(true);
                vTaskDelay(pdMS_TO_TICKS(120));
                red_led_write(false);
                vTaskDelay(pdMS_TO_TICKS(120));
        }
        gpio_set_level(RED_LED_GPIO, prev);
}

// Forward declaration van de characteristic zodat we hem in functies kunnen gebruiken
extern homekit_characteristic_t relay_on_characteristic;

// Centrale functie: zet state, stuurt hardware aan en (optioneel) HomeKit-notify
static void relay_set_state(bool on, bool notify_homekit) {
        if (relay_on == on) {
                // Geen verandering, niets te doen
                return;
        }

        relay_on = on;

        // Hardware aansturen
        relay_write(relay_on);
        blue_led_write(relay_on); // Blauwe LED volgt altijd de relay-status

        ESP_LOGI(RELAY_TAG, "Relay state -> %s", relay_on ? "ON" : "OFF");

        // HomeKit characteristic-snapshot updaten
        relay_on_characteristic.value = HOMEKIT_BOOL(relay_on);

        // Eventueel HomeKit-clients informeren
        if (notify_homekit) {
                homekit_characteristic_notify(&relay_on_characteristic,
                                              relay_on_characteristic.value);
        }
}

// All GPIO Settings
void gpio_init(void) {
        // Relay
        gpio_reset_pin(RELAY_GPIO);
        gpio_set_direction(RELAY_GPIO, GPIO_MODE_OUTPUT);

        // Blauwe LED (aan/uit)
        gpio_reset_pin(BLUE_LED_GPIO);
        gpio_set_direction(BLUE_LED_GPIO, GPIO_MODE_OUTPUT);

        // Rode LED: WiFi-status-indicator
        gpio_reset_pin(RED_LED_GPIO);
        gpio_set_direction(RED_LED_GPIO, GPIO_MODE_OUTPUT);

        // Initial state: alles uit, in sync brengen
        relay_on = false;
        relay_on_characteristic.value = HOMEKIT_BOOL(false);
        relay_write(false);
        blue_led_write(false);

        // Bij start is er nog geen WiFi -> status LED in WiFi-wachtstand
        s_led_mode = LED_MODE_WIFI_WAIT;
}

